<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,45,44" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_3190" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_3191" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_3192" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_3193" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/x__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/x__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_output_0">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_71" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="40" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/world_processor/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/Transpose_output_0">
					<dim>-1</dim>
					<dim>39</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_3567" type="Const" version="opset1">
			<data element_type="i8" shape="104, 3, 5" offset="64" size="1560" />
			<output>
				<port id="0" precision="I8">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convert_3568" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_3569" type="Const" version="opset1">
			<data element_type="f32" shape="104, 1, 1" offset="1624" size="416" />
			<output>
				<port id="0" precision="FP32">
					<dim>104</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/world_processor/groupConvBlock5/world_processor/groupConvBlock5/conv1d/0__1.0/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>104</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/groupConvBlock5/world_processor/groupConvBlock5/conv1d/0__1.0/FakeQuantize_output_0">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_3335" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_85" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>13</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/world_processor/groupConvBlock5/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2" pads_begin="0" pads_end="0" dilations="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>39</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>13</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_135" type="Const" version="opset1">
			<data element_type="f32" shape="1, 104, 1" offset="2072" size="416" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>104</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/world_processor/groupConvBlock5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>104</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/groupConvBlock5/Conv_output_0">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_3194" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_3195" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2492" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_3196" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_3197" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2492" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/world_processor/relu/world_processor/relu/relu/1__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/world_processor/relu/world_processor/relu/relu/1__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_3571" type="Const" version="opset1">
			<data element_type="i8" shape="104, 3, 5" offset="2496" size="1560" />
			<output>
				<port id="0" precision="I8">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Convert_3572" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_3573" type="Const" version="opset1">
			<data element_type="f32" shape="104, 1, 1" offset="4056" size="416" />
			<output>
				<port id="0" precision="FP32">
					<dim>104</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/world_processor/groupDil3ConvBlock5/world_processor/groupDil3ConvBlock5/conv1d/0__1.0/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>104</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/groupDil3ConvBlock5/world_processor/groupDil3ConvBlock5/conv1d/0__1.0/FakeQuantize_output_0">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_3336" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_145" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>104</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>13</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/world_processor/groupDil3ConvBlock5/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2" pads_begin="4" pads_end="4" dilations="3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>39</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>13</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_195" type="Const" version="opset1">
			<data element_type="f32" shape="1, 104, 1" offset="4472" size="416" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>104</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/world_processor/groupDil3ConvBlock5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>104</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/groupDil3ConvBlock5/Conv_output_0">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_3198" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_3199" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2492" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_3200" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_3201" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2492" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/world_processor/relu/world_processor/relu/relu/1__0.0_1/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/world_processor/relu/world_processor/relu/relu/1__0.0_1/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/world_processor/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>104</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/Concat_output_0">
					<dim>-1</dim>
					<dim>208</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_3575" type="Const" version="opset1">
			<data element_type="i8" shape="64, 208, 3" offset="4888" size="39936" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>208</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Convert_3576" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>208</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>208</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_3577" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1" offset="44824" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/world_processor/convBlock3_1/world_processor/convBlock3_1/conv1d/0__1.0/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>208</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/convBlock3_1/world_processor/convBlock3_1/conv1d/0__1.0/FakeQuantize_output_0">
					<dim>64</dim>
					<dim>208</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/world_processor/convBlock3_1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>208</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>208</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_249" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1" offset="45080" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/world_processor/convBlock3_1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/convBlock3_1/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_3202" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_3203" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="45336" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_3204" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_3205" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="45336" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/world_processor/relu/world_processor/relu/relu/2__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/world_processor/relu/world_processor/relu/relu/2__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Range_274" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/world_processor/GAP/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/GAP/GlobalAveragePool_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_3206" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_3207" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="45340" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_3208" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_3209" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="45340" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/world_processor/GAP/world_processor/GAP/adaptive_avg_pool1d/0__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/world_processor/GAP/world_processor/GAP/adaptive_avg_pool1d/0__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/world_processor/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/world_processor/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/world_processor/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/world_processor/Squeeze_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="45344" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="45352" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_2_output_0">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_75" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="40" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/vis_processor/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/Transpose_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_3579" type="Const" version="opset1">
			<data element_type="i8" shape="16, 1, 5" offset="45360" size="80" />
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Convert_3580" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_3581" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1" offset="45440" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/vis_processor/conv1/vis_processor/conv1/conv1d/0__1.0/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/conv1/vis_processor/conv1/conv1d/0__1.0/FakeQuantize_output_0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/vis_processor/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_211" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="45504" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/vis_processor/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/conv1/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_3210" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_3211" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="45568" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_3212" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_3213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="45568" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/vis_processor/relu/vis_processor/relu/relu/0__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/vis_processor/relu/vis_processor/relu/relu/0__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_3583" type="Const" version="opset1">
			<data element_type="i8" shape="64, 16, 5" offset="45572" size="5120" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>16</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Convert_3584" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>16</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_3585" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1" offset="50692" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/vis_processor/conv2/vis_processor/conv2/conv1d/0__1.0/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/conv2/vis_processor/conv2/conv1d/0__1.0/FakeQuantize_output_0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/vis_processor/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_235" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1" offset="50948" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/vis_processor/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/conv2/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_3214" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_3215" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="51204" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_3216" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_3217" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="51204" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/vis_processor/relu/vis_processor/relu/relu/1__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/vis_processor/relu/vis_processor/relu/relu/1__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Range_264" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/vis_processor/gap/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/gap/GlobalAveragePool_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/vis_processor/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/vis_processor/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/vis_processor/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/vis_processor/Squeeze_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/vis_processor/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/vis_processor/Sigmoid_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_3218" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_3219" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="51208" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_3220" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="2488" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_3221" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="51208" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/vis_processor/vis_processor/sigmoid/0__0.0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/vis_processor/vis_processor/sigmoid/0__0.0/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Mul_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_3222" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="51212" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_3223" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="51216" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_3224" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="51212" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_3225" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="51216" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="//avg_pool1d/0__0.0_1/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="//avg_pool1d/0__0.0_1/FakeQuantize_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="51220" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_1_output_0">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_73" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="40" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>45</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="45352" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_15_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_3_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_17_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="45344" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_19_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/Slice_4" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_4_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Sub_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_3226" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="51228" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_3227" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="51232" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_3228" type="Const" version="opset1">
